Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
data = np.array([4,8,15,16,23,42])
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
Elements =  ["Pwskills", 8, 2.35, "HP", "Microsoft", "Google", "Texla", "Apple", "SpaceX", "TataSons" ]
pd.Series(Elements)

0     Pwskills
1            8
2         2.35
3           HP
4    Microsoft
5       Google
6        Texla
7        Apple
8       SpaceX
9     TataSons
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

Name
Alice
Bob
Claire
Age
25
30
27

Gender
Female
Male
Female

In [7]:
Data  = { 'Name': ['Alice', 'Bob', 'Claire'], 'Age': ['25', '30','27'], 'Gender': ['Female', 'Male', 'Female']}

In [15]:
pd.DataFrame(Data)

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans) Series in pandas contains a single list which can store heterogeneous type of data, because of this, series is also considered as a 1-dimensional data structure. On the other hand, DataFrame is a 2-dimensional data structure which contains multiple lists of heterogeneous type of data.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans) a)df.head() and df.tail()-  The simplest way is to display some rows. Head and tail allow us to display rows from the top to bottom of data frame. 

b) datainfo() - Pandas dataframe.info() function is used to get a concise summary of the dataframe

c) data.dtpes()- Dtypes shows the data type of each column.

d) data.shape() - Return the number of rows and columns.

e) describe() - Describe the statistical data summary for every numerical column.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Data Structure	      Dimensions	        Data Type	          Data           Size
Series       	 One-dimensional array   	Homogeneous data	  Mutable   	Immutable
Data Frame	     Two-dimensional array	    Heterogeneous data	  Mutable	    Mutable
Panel	         Three-dimensional array    Heterogeneous data	  Mutable	    Mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [18]:
author = ['Jitender', 'Purnima',
          'Arpit', 'Jyoti']
article = [210, 211, 114, 178]

auth_series = pd.Series(author)
article_series = pd.Series(article)
 

frame = {'Author': auth_series,
         'Article': article_series}
 

result = pd.DataFrame(frame)

In [21]:
result

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178